Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CombineFormats Enumeration
 The combined dimension formats.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CombineFormats
Public Enumeration CombineFormats
Members
Member name | Value | Description
Off | 0 |  No combining.
NumberOfItemsTimesLength | 1 |  The number of items times the dimension length. E.g. 3*60.
NumberOfItemsTimesLengthEqualsResult | 2 |  The number of items times the dimension length equals the result. E.g. 3*60=180.
See Also
Reference
Tekla.Structures.Drawing Namespace